item_array = [
              ["レディースアイテム1",1000,"レディースアイテム1","新品","送料込み","東京都","2日から3日くらい",200,700,4,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["レディースアイテム2",2000,"レディースアイテム2","新品","送料込み","東京都","2日から3日くらい",200,700,4,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["レディースアイテム3",3000,"レディースアイテム3","新品","送料込み","東京都","2日から3日くらい",200,700,4,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["レディースアイテム4",4000,"レディースアイテム4","新品","送料込み","東京都","2日から3日くらい",200,700,4,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["レディースアイテム5",5000,"レディースアイテム5","新品","送料込み","東京都","2日から3日くらい",200,700,4,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["レディースアイテム6",6000,"レディースアイテム6","新品","送料込み","東京都","2日から3日くらい",200,700,4,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["レディースアイテム7",7000,"レディースアイテム7","新品","送料込み","東京都","2日から3日くらい",200,700,4,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["レディースアイテム8",8000,"レディースアイテム8","新品","送料込み","東京都","2日から3日くらい",200,700,4,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["レディースアイテム9",9000,"レディースアイテム9","新品","送料込み","東京都","2日から3日くらい",200,700,4,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["レディースアイテム10",10000,"レディースアイテム10","新品","送料込み","東京都","2日から3日くらい",200,700,4,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["メンズアイテム1",1000,"メンズアイテム1","新品","送料込み","東京都","2日から3日くらい",200,700,257,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["メンズアイテム2",2000,"メンズアイテム2","新品","送料込み","東京都","2日から3日くらい",200,700,257,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["メンズアイテム3",3000,"メンズアイテム3","新品","送料込み","東京都","2日から3日くらい",200,700,257,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["メンズアイテム4",4000,"メンズアイテム4","新品","送料込み","東京都","2日から3日くらい",200,700,257,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["メンズアイテム5",5000,"メンズアイテム5","新品","送料込み","東京都","2日から3日くらい",200,700,257,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["メンズアイテム6",6000,"メンズアイテム6","新品","送料込み","東京都","2日から3日くらい",200,700,257,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["メンズアイテム7",7000,"メンズアイテム7","新品","送料込み","東京都","2日から3日くらい",200,700,257,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["メンズアイテム8",8000,"メンズアイテム8","新品","送料込み","東京都","2日から3日くらい",200,700,257,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["メンズアイテム9",9000,"メンズアイテム9","新品","送料込み","東京都","2日から3日くらい",200,700,257,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["メンズアイテム10",10000,"メンズアイテム10","新品","送料込み","東京都","2日から3日くらい",200,700,257,2,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["シャネルアイテム1",1000,"シャネルアイテム1","新品","送料込み","東京都","2日から3日くらい",200,700,377,2447,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["シャネルアイテム2",2000,"シャネルアイテム2","新品","送料込み","東京都","2日から3日くらい",200,700,377,2447,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["シャネルアイテム3",3000,"シャネルアイテム3","新品","送料込み","東京都","2日から3日くらい",200,700,377,2447,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["シャネルアイテム4",4000,"シャネルアイテム4","新品","送料込み","東京都","2日から3日くらい",200,700,377,2447,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["シャネルアイテム5",5000,"シャネルアイテム5","新品","送料込み","東京都","2日から3日くらい",200,700,377,2447,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["シャネルアイテム6",6000,"シャネルアイテム6","新品","送料込み","東京都","2日から3日くらい",200,700,377,2447,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["シャネルアイテム7",7000,"シャネルアイテム7","新品","送料込み","東京都","2日から3日くらい",200,700,377,2447,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["シャネルアイテム8",8000,"シャネルアイテム8","新品","送料込み","東京都","2日から3日くらい",200,700,377,2447,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["シャネルアイテム9",9000,"シャネルアイテム9","新品","送料込み","東京都","2日から3日くらい",200,700,377,2447,2,1,2,"","",5,"ゆうゆうメルカリ便"],
              ["シャネルアイテム10",10000,"シャネルアイテム10","新品","送料込み","東京都","2日から3日くらい",200,700,377,2447,2,1,2,"","",5,"ゆうゆうメルカリ便"]
            ]

item_array.each do |item|
  Item.create!(name: item[0], price: item[1], explanation:item[2], condition:item[3], shipping_charge:item[4], delivery_source_area:item[5], delivery_days:item[6], commission:item[7], profit:item[8], category_id:item[9], brand_id:item[10], size_id:item[11], saler_id:item[12], buyer_id:item[13], shipped_saler_id:item[14], received_buyer_id:item[15], like_num:item[16], how_to_ship: item[17])
end
